app/controllers/collects_controller.rb

  def index
    @collects = Collect.all
---
SELECT "collects".* FROM "collects"

  def create
    @collect = Collect.new(collect_params)

    respond_to do |format|
      if @collect.save
---
INSERT INTO "collects" ("resident_id", "collected_on", "ammount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["resident_id", 1], ["collected_on", "1111-11-11 11:11:00"], ["ammount", "10.0"], ["created_at", "2024-05-14 23:52:18.127604"], ["updated_at", "2024-05-14 23:52:18.127604"]]

  def update
    respond_to do |format|
      if @collect.update(collect_params)
---
UPDATE "collects" SET "resident_id" = ?, "updated_at" = ? WHERE "collects"."id" = ?  [["resident_id", 1021807983446717952], ["updated_at", "2024-03-23 23:27:22.152550"], ["id", 103336229485488617]]

  def destroy
    @collect.destroy
---
DELETE FROM "collects" WHERE "collects"."id" = ?  [["id", 13]]

    def set_collect
      @collect = Collect.find(params[:id])
---
SELECT "collects".* FROM "collects" WHERE "collects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]