app/controllers/residents_controller.rb

  def index
    @residents = Resident.all
---
SELECT "residents".* FROM "residents"

  def create
    @resident = Resident.new(resident_params)

    respond_to do |format|
      if @resident.save
---
INSERT INTO "residents" ("name", "situation", "roka_id", "has_plaque", "registration_year", "address", "reference_point", "lives_in_jn", "phone", "is_on_whatsapp_group", "birthdate", "profession", "residents_in_the_house", "observations", "needs_collect_on_the_house", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def update
    respond_to do |format|
      if @resident.update(resident_params)
---
UPDATE "residents" SET "situation" = ?, "roka_id" = ?, "registration_year" = ?, "updated_at" = ? WHERE "residents"."id" = ?  [["situation", 0], ["roka_id", 3], ["registration_year", 1990], ["updated_at", "2024-02-19 23:00:28.716863"], ["id", 4]]

  def destroy
    @resident.destroy
---
DELETE FROM "residents" WHERE "residents"."id" = $1  [["id", 1]]

    def set_resident
      @resident = Resident.find(params[:id])
---
SELECT "residents".* FROM "residents" WHERE "residents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]